# Options Class

---
User preferences for parsing of geometry.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class Options : APIObject

    Public Class Options
    	Inherits APIObject

    public ref class Options : public APIObject

    type Options =
        class
            inherit APIObject
        end
The Options type exposes the following members.
| Name| Description
---|---|---
| Options| Creates a default Options object.
| Options(Options)| Copy constructor.
Top
| Name| Description
---|---|---
| ComputeReferences| Determines whether or not references to geometric objects are computed.
| DetailLevel| The detail level for the geometry extracted with these options.
| IncludeNonVisibleObjects| Whether to extract element geometry objects not set as Visible. The default is false.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| View| The view used for geometry extraction.
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
This class determines the output of the Element.Geometry property.
#### Reference
Autodesk.Revit.DB Namespace